Repository: AmirKhairy/SmartLabel
Catalog: lib/l10n/intl_*.arb
Languages: ar

# signPageSignInButton
source: Sign In
ar: تسجيل الدخول

# signPageSignUpButton
source: Sign Up
ar: إنشاء حساب

# loginEmailLabel
source: Email
ar: البريد الإلكتروني

# loginEmailValidation
source: Please enter your email
ar: يرجى ادخال البريد الإلكتروني

# loginPasswordLabel
source: Password
ar: كلمة المرور

# loginPasswordHint
source: Password
ar: كلمة المرور

# loginPasswordValidation
source: Please enter your password
ar: يرجى ادخال كلمة المرور

# signInButton
source: Sign In
ar: تسجيل الدخول

# loginGoBackButton
source: Go Back
ar: العودة

# loginForgotPassword
source: Forgot Password?
ar: هل نسيت كلمة المرور؟

# forgotPasswordTitle
source: Forgot Password
ar: نسيت كلمة المرور

# forgotPasswordEmailLabel
source: Email
ar: البريد الإلكتروني

# forgotPasswordEmailValidation
source: Please enter your email
ar: يرجى ادخال البريد الإلكتروني

# forgotPasswordSubmitButton
source: Submit
ar: إرسال

# forgotPasswordCodeLabel
source: Code
ar: الرمز

# forgotPasswordCodeHint
source: Enter your code
ar: أدخل الرمز الخاص بك

# forgotPasswordCodeValidation
source: Please enter your code
ar: يرجى ادخال الرمز الخاص بك

# forgotPasswordNewPasswordLabel
source: New Password
ar: كلمة المرور الجديدة

# forgotPasswordNewPasswordHint
source: Enter your new password
ar: أدخل كلمة المرور الجديدة

# forgotPasswordConfirmPasswordLabel
source: Confirm Password
ar: تأكيد كلمة المرور

# forgotPasswordConfirmPasswordHint
source: Enter your confirm password
ar: أدخل تأكيد كلمة المرور

# forgotPasswordNewPasswordValidation
source: Please enter your new password
ar: يرجى ادخال كلمة المرور الجديدة

# forgotPasswordConfirmPasswordValidation
source: Please enter your confirm password
ar: يرجى ادخال تأكيد كلمة المرور

# forgotPasswordConfirmPasswordDontMatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# passwordValidationUpperCase
source: Must contain an uppercase letter (A-Z)
ar: يجب أن تحتوي على حرف كبير (A-Z)

# passwordValidationLowerCase
source: Must contain a lowercase letter (a-z)
ar: يجب أن تحتوي على حرف صغير (a-z)

# passwordValidationNumber
source: Must contain a number (0-9)
ar: يجب أن تحتوي على رقم (0-9)

# passwordValidationSpecialChar
source: Must contain a special character (!@#$%^&*)
ar: يجب أن تحتوي على رمز خاص (!@#$%^&*)

# passwordValidationMinLength
source: Must be at least 8 characters long
ar: يجب أن تكون 8 أحرف على الأقل

# signupFirstNameLabel
source: First Name
ar: الاسم الأول

# signupFirstNameHint
source: Enter your first name
ar: أدخل الاسم الأول

# signupLastNameLabel
source: Last Name
ar: اسم العائلة

# signupLastNameHint
source: Enter your last name
ar: أدخل اسم العائلة

# signupEmailLabel
source: Email
ar: البريد الإلكتروني

# signupPasswordLabel
source: Password
ar: كلمة المرور

# signupPasswordHint
source: Enter your password
ar: أدخل كلمة المرور

# signupConfirmPasswordLabel
source: Confirm Password
ar: تأكيد كلمة المرور

# signupConfirmPasswordHint
source: Enter your confirm password
ar: أدخل تأكيد كلمة المرور

# signupFirstNameValidation
source: Please enter your first name
ar: يرجى ادخال الاسم الأول

# signupLastNameValidation
source: Please enter your last name
ar: يرجى ادخال اسم العائلة

# signupEmailValidation
source: Please enter your email
ar: يرجى ادخال البريد الإلكتروني

# signupPasswordValidation
source: Please enter your password
ar: يرجى ادخال كلمة المرور

# signupConfirmPasswordValidation
source: Please enter your confirm password
ar: يرجى ادخال تأكيد كلمة المرور

# signupConfirmPasswordDontMatchValidation
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# signupButton
source: Sign Up
ar: إنشاء حساب

# signupGoBackButton
source: Go Back
ar: العودة

# navBarHome
source: Home
ar: الرئيسية

# navBarCategories
source: Categories
ar: الفئات

# navBarFav
source: Favourites
ar: المفضلة

# navBarProfile
source: Profile
ar: الملف الشخصي

# homePageNewProducts
source: Featured Products
ar: منتجات جديدة

# homePageNewCategories
source: Categories
ar: الفئات

# seeAllButton
source: See All
ar: اظهار الكل

# profilePageTitle
source: Profile
ar: الملف الشخصي

# profilePageSettings
source: Settings
ar: الإعدادات

# profilePageSignInButton
source: Sign In
ar: تسجيل الدخول

# profilePageSingUpButton
source: Sign Up
ar: إنشاء حساب

# profilePageSingOutButton
source: Sign Out
ar: تسجيل الخروج

# profilePageChangePasswordButton
source: Change Password
ar: تغيير كلمة المرور

# profilePageDeleteAccountButton
source: Delete Account
ar: حذف الحساب

# profilePageAdminPanel
source: Admin Panel
ar: لوحة الإدارة

# profilePageEditProfileTitle
source: Edit Profile
ar: تعديل الملف الشخصي

# profilePageEditProfileFirstNameLabel
source: First Name
ar: الاسم الأول

# profilePageEditProfileLastNameLabel
source: Last Name
ar: اسم العائلة

# profilePageUserInfoFirstName
source: First Name
ar: الاسم الأول

# profilePageUserInfoLastName
source: Last Name
ar: اسم العائلة

# profilePageUserInfoEmail
source: Email
ar: البريد الإلكتروني

# saveButton
source: Save
ar: حفظ

# cancelButton
source: Cancel
ar: إلغاء

# deleteButton
source: Delete
ar: حذف

# profilePageChangePasswordTitle
source: Change Password
ar: تغيير كلمة المرور

# profilePageChangePasswordCurrentPasswordLabel
source: Current Password
ar: كلمة المرور الحالية

# profilePageChangePasswordNewPasswordLabel
source: New Password
ar: كلمة المرور الجديدة

# profilePageChangePasswordConfirmPasswordLabel
source: Confirm Password
ar: تأكيد كلمة المرور

# profilePageDeleteAccountTitle
source: Delete Account
ar: حذف الحساب

# profilePageDeleteAccountText
source: Are you sure you want to delete your account? This action cannot be undone.
ar: هل انت متاكد من حذف حسابك؟ لا يمكن التراجع عن هذا الحذف.

# profilePageSideMenuTitle
source: Settings
ar: الإعدادات

# profilePageSideMenuDarkMode
source: Dark Mode
ar: الوضع الداكن

# profilePageSideMenuChangeLanguageTitle
source: Change Language
ar: تغيير اللغة

# profilePageSideMenuChangeLanguageDialogTitle
source: Change Language
ar: تغيير اللغة

# profilePageSideMenuChangeLanguageDialogEnglish
source: English
ar: الإنجليزية

# profilePageSideMenuChangeLanguageDialogArabic
source: Arabic
ar: العربية

# profilePageSideMenuAboutUsTitle
source: About Us
ar: من نحن

# profilePageSideMenuAboutUsDialogTitle
source: About Us
ar: من نحن

# profilePageSideMenuAboutUsDialogText
source: Smart Label is a next-gen pricing and inventory platform for retailers. Version: 1.0.0 Â© 2025 Smart Label Inc.
ar: Smart Label هي منصة الجيل القادم لتسعير وإدارة المخزون لتجار التجزئة. الإصدار: 1.0.0 © 2025 شركة Smart Label.

# profilePageSideMenuAboutUsDialogButton
source: OK
ar: موافق

source: Login Success
ar: نجاح التسجيل

source: Email is not confirmed, please check your email
ar: البريد الألكتروني غير موثق، يرجى التحقق من بريدك الألكتروني

source: Registration successful! We have sent a confirmation email to your address.
ar: تم التسجيل بنجاح, لقد ارسلنا اليك رسالة تأكيد علي بريدك الالكتروني

source: Code sent successfully, check your email
ar: تم ارسال الكود بنجاح، يرجى التحقق من بريدك الألكتروني

source: Code Verified Successfully
ar: تم التحقق من الكود بنجاح

source: Password Changed Successfully
ar: تم تغيير كلمة المرور بنجاح

source: Failed to load products
ar: فشل تحميل المنتجات

source: No Products Found
ar: لا يوجد منتجات

source: Failed to load categories
ar: فشل تحميل الفئات

source: No categories found
ar: لا يوجد فئات

# failedToLoadFavourites
source: Failed to load favorites
ar: فشل تحميل المفضلات

# noFavouritesFound
source: No favorites found
ar: لا يوجد مفضلات

source: Please login first
ar: يرجى تسجيل الدخول اولا

source: Failed to load user info
ar: فشل تحميل معلومات المستخدم

source: Sign Out Successfully
ar: تم تسجيل الخروج بنجاح

source: Banner Details
ar: تفاصيل البنر

source: Failed to load banner details
ar: فشل تحميل تفاصيل البنر

# bannerDetailsTitle
source: Title:
ar: العنوان:

# bannerDetailsStartDate
source: Start Date:
ar: تاريخ البدء:

# bannerDetailsEndDate
source: End Date:
ar: تاريخ النهاية:

# bannerDetailsDescription
source: Description:
ar: الوصف:

source: You must be logged in.
ar: يجب عليك تسجيل الدخول.

source: Product Details
ar: تفاصيل المنتج

source: Failed to load product details.
ar: فشل تحميل تفاصيل المنتج.

# productDetailsPrice
source: Price:
ar: السعر:

# productDetailsDescription
source: Description:
ar: الوصف:

source: Category Products
ar: منتجات الفئة

source: Failed to load category products.
ar: فشل تحميل منتجات الفئة.

source: No category products found in this category.
ar: لا يوجد منتجات في هذه الفئة.

source: Profile Updated Successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Account Deleted Successfully
ar: تم حذف الحساب بنجاح

source: Search
ar: البحث

# searchProductsLabel
source: Products
ar: المنتجات

# searchCategoriesLabel
source: Categories
ar: الفئات

# searchSortProductsByDefault
source: default
ar: الافتراضي

# searchSortProductsByName
source: name
ar: الاسم

# searchSortProductsByPrice
source: price
ar: السعر

# searchSortCategoriesByDefault
source: default
ar: الافتراضي

# searchSortCategoriesByName
source: name
ar: الاسم

# searchOrderByAsc
source: asc
ar: تصاعدي

# searchOrderByDesc
source: desc
ar: تنازلي

# searchLabel
source: Search
ar: بحث

# searchHint
source: Search
ar: بحث

# searchValidation
source: Please enter a search term
ar: يرجى ادخال بحث

source: No items found with this name
ar: لا يوجد عناصر مطابقة بهذا الاسم

source: Search for any item
ar: ابحث عن اي عنصر

source: Notifications
ar: الاشعارات

source: Failed to load notifications
ar: فشل تحميل الاشعارات

source: No notifications found
ar: لا يوجد اشعارات

source: Banner Deleted Successfully
ar: تم حذف البانر بنجاح

# errorDeletingBanner
source: Error while Deleting Banner, try again
ar: حدث خطأ أثناء حذف البانر، حاول مرة أخرى

source: Category Deleted successfully
ar: تم حذف الفئة بنجاح

# errorDeletingCategory
source: Error while Deleting Category, try again
ar: حدث خطأ أثناء حذف الفئة، حاول مرة أخرى

source: Admin Panel
ar: لوحة الإدارة

source: All Banners
ar: جميع البانرات

# editUsersButton
source: Edit Users
ar: تعديل المستخدمين

# manageAdminRules
source: Manage Admin Roles
ar: إدارة صلاحيات المدير

# manageAdminText
source: Enter the user's email to add or remove admin access.
ar: أدخل بريد المستخدم لإضافة أو إزالة صلاحيات المدير.

# userEmailLabel
source: User Email
ar: بريد المستخدم

# userEmailValidation
source: Please enter user email
ar: يرجى إدخال بريد المستخدم

source: is admin now
ar: اصبح مدير الآن

source: is no longer admin
ar: لم يعد مديرًا

source: Make Admin
ar: جعله مدير

source: Remove Admin
ar: إزالة من المدير

source: There is no Banners
ar: لا يوجد بانرات

# bannerConfirmDeletion
source: Confirm Deletion
ar: تأكيد الحذف

source: Are you sure you want to delete this Banner?
ar: هل أنت متأكد أنك تريد حذف هذا البانر؟

# bannerDeleteCancelButton
source: Cancel
ar: إلغاء

# bannerDeleteDeleteButton
source: Delete
ar: حذف

source: All Categories
ar: جميع الفئات

# addBannerButton
source: Add Banner
ar: إضافة بانر

# addBannerDialogTitle
source: Add Banner
ar: إضافة بانر

# addBannerDialogBannerTitle
source: Title
ar: العنوان

# addBannerDialogBannerDescription
source: Description
ar: الوصف

# addBannerDialogBannerSelectDate
source: Select Date
ar: اختر التاريخ

# addBannerDialogBannerStartDate
source: Start Date:
ar: تاريخ البدء:

# addBannerDialogBannerEndDate
source: End Date:
ar: تاريخ الانتهاء:

# addBannerDialogBannerPickMainImage
source: Pick Main Image
ar: اختر الصورة الرئيسية

# addBannerDialogBannerPickBannerImages
source: Pick Banner Images
ar: اختر صور البانر

# addBannerDialogBannerApply
source: Apply
ar: تطبيق

# addBannerDialogBannerCancel
source: Cancel
ar: إلغاء

# bannerAddedSuccessfuly
source: Banner added successfully.
ar: تم إضافة البانر بنجاح.

# errorAddingBanner
source: Error occured while adding banner, Please try again.
ar: حدث خطأ أثناء إضافة البانر، يرجى المحاولة مرة أخرى.

# bannerTitleValidation
source: Title must not be empty.
ar: يجب ألا يكون العنوان فارغًا.

# bannerStartAndEndDateValidation
source: Start and end dates must be selected.
ar: يجب تحديد تاريخ البدء والانتهاء.

# bannerStartDateMustBeBeforeEndDate
source: Start date must be before end date.
ar: يجب أن يكون تاريخ البدء قبل تاريخ الانتهاء.

# bannerStartDateMustNotBeBeforeNow
source: Start date must not be before our time.
ar: يجب أن لا يكون تاريخ البدء قبل الوقت الحالي.

# bannerMainImageValidation
source: Please select a main image.
ar: يرجى اختيار صورة رئيسية.

# bannerBannerImagesValidation
source: Please select at least one image.
ar: يرجى اختيار صورة واحدة على الأقل.

# editBannerDetails
source: Banner Details
ar: تفاصيل البانر

source: Banner Updated Successfully
ar: تم تحديث البانر بنجاح

# editBannerMainImageButton
source: Edit Main Image
ar: تعديل الصورة الرئيسية

source: Set Main Banner Image
ar: تعيين صورة البانر الرئيسية

# editBannerDialogPickMainImage
source: Pick main image
ar: اختر الصورة الرئيسية

# editBannerDialogApplyButton
source: Apply
ar: تطبيق

# editBannerAddImagesButton
source: Add Images
ar: إضافة صور

# editBannerAddImagesDialogTitle
source: Add Images
ar: إضافة صور

# editBannerAddImagesDialogPickBannreImages
source: Pick Banner Images
ar: اختر صور البانر

# editBannerAddImagesDialogCancelButton
source: Cancel
ar: إلغاء

# editBannerAddImagesDialogApplyButton
source: Apply
ar: تطبيق

# editBannerTitleText
source: Title
ar: العنوان

# editBannerStartDateText
source: Start Date
ar: تاريخ البدء

# editBannerEndDateText
source: End Date
ar: تاريخ الانتهاء

# editBannerDescriptionText
source: Description
ar: الوصف

# editBannerSaveButton
source: Save Changes
ar: حفظ التغييرات

# editBannerDiscardButton
source: Discard
ar: إلغاء

source: There is no Categories
ar: لا يوجد فئات

# categoryConfirmDeletion
source: Confrm Deletion
ar: تأكيد الحذف

# categoryDeletionText
source: Are you sure you want to delete this category?,
ar: هل تريد حذف هذه الفئة؟ سيتم حذف جميع المنتجات الموجوده في هذه الفئة ايضا,

# categoryDeletionCancelButton
source: Cancel
ar: اغلاق

# categoryDeletionDeleteButton
source: Delete
ar: حذف

source: Category added successfully.
ar: تم اضافة الفئة بنجاح.

# categoryFailedToAdd
source: Failed to add category. Try again.
ar: حدث خطاء اثناء اضافة الفئة، يرجى المحاولة مرة اخرى.

# categoryDialogTitle
source: Add Category
ar: اضافة فئة

# categoryDialogCategoryName
source: Category Name
ar: اسم الفئة

# categoryDialogPickImage
source: Pick Category Image
ar: اختر صورة الفئة

# categoryDialogCancelButton
source: Cancel
ar: اغلاق

# categoryDialogApplyButton
source: Apply
ar: تطبيق

# categoryDialogNameValidation
source: Category name must not be empty.
ar: اسم الفئة لا يمكن ان يكون فارغ.

# categoryDialogNameLengthValidation
source: Category name must be at least 3 characters.
ar: اسم الفئة يجب ان يكون على الاقل 3 حروف.

# categoryDialogImageValidation
source: Please select an image for the category.
ar: يرجى اختيار صورة للفئة.

source: Category Updated Successfully
ar: تم تحديث الفئة بنجاح.

source: Product Deleted Successfully
ar: تم حذف المنتج بنجاح.

# productDeletedError
source: Error while Deleting Product, try again
ar: حدث خطاء اثناء حذف المنتج، يرجى المحاولة مرة اخرى.

source: No Category details available.
ar: لا توجد تفاصيل للفئة.

# editCategoryAppBarTitle
source: Edit Category
ar: تعديل الفئة

# editCategoryName
source: CategoryName
ar: اسم الفئة

# editCategoryEditImageButton
source: Edit Image
ar: تعديل الصورة

source: Set New Category Image
ar: تعيين صورة الفئة

# pickNewCategoryImage
source: Pick Image
ar: اختر صورة الفئة

# pickNewCategoryImageCancel
source: Cancel
ar: اغلاق

# pickNewCategoryImageApply
source: Apply
ar: تطبيق

# editCategorySaveChangesButton
source: Save changes
ar: حفظ التغييرات

# editCategoryDiscardChangesButton
source: Discard
ar: تجاهل التغييرات

# editCategoryNameValidation
source: Name must be at least 3 characters
ar: اسم الفئة يجب ان يكون على الاقل 3 حروف.

# categoryProductsTitle
source: Products
ar: منتجات

# noProductsInThisCategory
source: No Products Available for this Category
ar: لا يوجد منتجات في هذه الفئة.

# productConfirmDeletion
source: Confirm Deletion
ar: تأكيد الحذف

# productConfirmDeletionText
source: Are you sure you want to delete this Product?
ar: هل انت متاكد انك تريد حذف هذا المنتج؟

# productDeletionCancelButton
source: Cancel
ar: اغلاق

# productDeletionDeleteButton
source: Delete
ar: حذف

source: Product added successfully.
ar: تم اضافة المنتج بنجاح.

# productFailedToAdd
source: Failed to add product. Try again.
ar: حدث خطاء اثناء اضافة المنتج، يرجى المحاولة مرة اخرى.

# addProductDialogTitle
source: Add Product
ar: اضافة منتج

# addProductDialogName
source: Product Name
ar: اسم المنتج

# addProductDialogPrice
source: Price
ar: السعر

# addProductDialogDiscount
source: Discount (%)
ar: الخصم

# addProductDialogDescription
source: Description
ar: الوصف

# addProductDialogPickImageButton
source: Pick Image
ar: اختر صورة المنتج

# addProductDialogPickImagesButton
source: Pick Product Images
ar: اختر صور المنتج

# addProductDialogCancelButton
source: Cancel
ar: اغلاق

# addProductDialogAddButton
source: Add
ar: اضافة

# addProductNameValidation
source: Product name must not be empty.
ar: اسم المنتج لا يمكن ان يكون فارغ.

# addProductPriceValidation
source: Price must not be empty.
ar: السعر لا يمكن ان يكون فارغ.

# addProductPricePositiveValidation
source: Price must be a valid positive number.
ar: السعر يجب ان يكون رقما صحيحا.

# addProductDiscountValidation
source: Discount must not be empty.
ar: الخصم لا يمكن ان يكون فارغ.

# addProductDiscountValidNumber
source: Discount must be a valid number between 0 and 100.
ar: الخصم يجب ان يكون رقما صحيحا بين 0 و 100.

# addProductMainImageValidation
source: Please select a main image.
ar: يرجى اختيار صورة رئيسية.

# editProductAppBarTitle
source: Edit Product
ar: تعديل المنتج

source: Product Updated Successfully
ar: تم تحديث المنتج بنجاح.

# productUpdatedError
source: Error while Updating Product, try again
ar: حدث خطاء اثناء تحديث المنتج، يرجى المحاولة مرة اخرى.

source: No Product details available.
ar: لا توجد تفاصيل للمنتج.

# editProductEditMainImageButton
source: Edit Main Image
ar: تعديل صورة رئيسية

# editProductEditMainImageTitle
source: Set Main Product Image
ar: تعيين صورة رئيسية للمنتج

# editProductEditMainImagePickImage
source: Pick Main Image
ar: اختر صورة رئيسية

# editProductEditMainImageApply
source: Apply
ar: تطبيق

# editProductEditMainImageCancel
source: Cancel
ar: اغلاق

# editProductAddImagesButton
source: Add Images
ar: اضافة صور

# editProductAddImagesDialogTitle
source: Add Product Images
ar: اضافة صور للمنتج

# editProductAddImagesDialogPickProductImages
source: Pick Product Images
ar: اختر صور المنتج

# editProductAddImagesDialogCancel
source: Cancel
ar: اغلاق

# editProductAddImagesDialogApply
source: Apply
ar: تطبيق

# editProductName
source: Name
ar: اسم

# editProductPrice
source: Price
ar: السعر

# editProductDiscount
source: Discount
ar: الخصم

# editProductDescription
source: Description
ar: الوصف

# editProductSaveChangesButton
source: Save Changes
ar: حفظ التغييرات

# editProductDiscardChangesButton
source: Discard
ar: تجاهل التغييرات

# editProductNameValidation
source: Name must be not empty
ar: اسم المنتج لا يمكن ان يكون فارغ.

# editProductPriceValidation
source: Price must be not empty
ar: السعر لا يمكن ان يكون فارغ.

# editProductPricePositiveValidation
source: Price must be a valid positive number
ar: السعر يجب ان يكون رقما صحيحا.

# editProductDiscountValidation
source: Discount must be not empty
ar: الخصم لا يمكن ان يكون فارغ.

# editProductDiscountNumberValidation
source: Discount must be a valid number between 0 and 100
ar: الخصم يجب ان يكون رقما صحيحا بين 0 و 100.

# unknownNotificationTybe
source: Unknown Notification Type
ar: نوع الاشعار غير معروف

source: Banner details not found
ar: تم حذف هذا البانر

source: Product details not found
ar: تم حذف هذا المنتج

source: Invalid notification details
ar: تفاصيل الاشعار غير صحيحة

source: Invalid notification
ar: اشعار غير صحيح

# categoriesAppBarr
source: Categories
ar: الفئات

# navBarCart
source: Cart
ar: سلة التسوق

source: Browse Products
ar: تصفح المنتجات

source: Failed to load Banners
ar: فشل تحميل البانرات

# productsAppBarTitle
source: Products
ar: المنتجات
